morseRus = ('.-', '-...', '.--', '--.', '-..', '.',
			'.', '...-', '--..', '..', '.---', '-.-',
			'.-..', '--', '-.', '---', '.--.', '.-.',
			'...', '-', '..-', '..-.', '....', '-.-.',
			'---.', '----', '--.-', '.--.-.', '-.--', '-..-',
			'..-..', '..--', '.-.-', '.----', '..---', '...--',
			'....-', '.....', '-....', '--...', '---..', '----.', '-----')

morseEng = ('.-', '-...', '-.-.', '-..', '.', '..-.',
			'--.', '....', '..', '.---', '-.-', '.-..',
			'--', '-.', '---', '.--.', '--.-', '.-.',
			'...', '-', '..-', '...-', '.--', '-..-',
			'-.--', '--..', '.----', '..---', '...--',
			'....-', '.....', '-....', '--...', '---..', '----.', '-----')

rus = ('а', 'б', 'в', 'г', 'д', 'е',
	   'ё', 'ж', 'з', 'и', 'й', 'к',
	   'л', 'м', 'н', 'о', 'п', 'р',
	   'с', 'т', 'у', 'ф', 'х', 'ц',
	   'ч', 'ш', 'щ', 'ъ', 'ы', 'ь',
	   'э', 'ю', 'я', '1', '2', '3',
	   '4', '5', '6', '7', '8', '9', '0')

eng = ('a', 'b', 'c', 'd', 'e', 'f',
	   'g', 'h', 'i', 'j', 'k', 'l',
	   'm', 'n', 'o', 'p', 'q', 'r',
	   's', 't', 'u', 'v', 'w', 'x',
	   'y', 'z', '1', '2', '3', '4',
	   '5', '6', '7', '8', '9', '0')

t = input('Вы хотите расшифровать или зашифровать текст, введите соответствено 1 или 2: ')
lang = input('Русский или английский? Введите соответствено 1 или 2: ')
if lang == '1':
	lang = rus
	morse = morseRus
else:
	lang = eng
	morse = morseEng
if t == '1':
	s = input('Введите текст, который хотите расшифровать: ')
	encrypt = ''
	l = ''
	w = ''
	for i in range(len(s)):
		if s[i-1] == ' ' and s[i] == ' ':
			encrypt += w + ' '
			w = ''
		elif i == len(s) - 1:
			l += s[i]
			if l not in morse:
				w += l
			else:
				w += lang[morse.index(l)]
			encrypt += w
			l = ''
		elif s[i] == ' ':
			if l not in morse:
				w += l
			else:
				w += lang[morse.index(l)]
			l = ''
		else:
			l += s[i]
	print(encrypt)
else:
	s = input('Введите текст, который хотите зашифровать: ').lower()
	crypt = ''
	l = ''
	for i in range(len(s)):
		if s[i] == ' ':
			crypt += ' '
		else:
			if s[i] not in lang:
				crypt += s[i] + ' '
			else:
				crypt += morse[lang.index(s[i])] + ' '
	crypt = crypt[:len(crypt)-1]
	print(crypt)